#include <stdio.h>
#include <fcntl.h>
#include <linux/i2c-dev.h>
#include <unistd.h>
#include <stdint.h>

#define MAX_LED_NUM      4//LED个数
#define MAX_HUB_NUM      8//HUB camera总数
#define MAX_BOX_DOOR_NUM 1//门总数


//标签信息结构体
struct devStatusRes
{
  char hub_status[MAX_HUB_NUM];
  char led_status[MAX_LED_NUM];
  char door_status[MAX_BOX_DOOR_NUM];
  char lock_status[MAX_BOX_DOOR_NUM];
};

//枚举获取设备状态个外设对应的bit位
enum DEV_STATUS_NUM{
    DEV_HUB0_BIT,//HUB0对应的PCA9535的序号
    DEV_HUB1_BIT,//HUB1对应的PCA9535的序号
    DEV_HUB2_BIT,//HUB2对应的PCA9535的序号
    DEV_HUB3_BIT,//HUB3对应的PCA9535的序号
    DEV_HUB4_BIT,//HUB4对应的PCA9535的序号
    DEV_HUB5_BIT,//HUB5对应的PCA9535的序号
    DEV_HUB6_BIT,//HUB6对应的PCA9535的序号
    DEV_HUB7_BIT,//HUB7对应的PCA9535的序号
    DEV_DOOR_OPEN_BIT,//门开关控制对应的PCA9535的序号
    DEV_GATE_IN_BIT,//rfid门信号检测PCA9535的序号
    DEV_LOCK_IN_BIT,//锁开关检测对应的PCA9535的序号
    DEV_FRID_CTL_BIT,//门锁适配控制对应的PCA9535的序号
    DEV_LED0_BIT,//LED0对应的PCA9535的序号
    DEV_LED1_BIT,//LED1对应的PCA9535的序号
    DEV_LED2_BIT,//LED2对应的PCA9535的序号
    DEV_LED3_BIT,//LED3对应的PCA9535的序号
    DEV_STATUS_MAX_NUM
};
/*==================================================================================
* 函 数 名： open_close_door_rfid_pair
* 参    数： 
* 功能描述:  true打开门rfid配对；false关闭门rfid配对
* 返 回 值：
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
void open_close_door_rfid_pair(bool flag);

/*==================================================================================
* 函 数 名： peripheral_device_init
* 参    数： 
* 功能描述:  外设初始化
* 返 回 值： None
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
int peripheral_device_init(void);
/*==================================================================================
* 函 数 名： open_box_lock
* 参    数： 
* 功能描述:  打开设备锁
* 返 回 值：
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
int open_box_lock(void);
/*==================================================================================
* 函 数 名： close_box_lock
* 参    数： 
* 功能描述:  关闭设备锁
* 返 回 值：
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
int close_box_lock(void);

/*==================================================================================
* 函 数 名： open_close_usb_device
* 参    数： num==usb设备号;flag==true打开设备
* 功能描述:  打开关闭USB
* 返 回 值：
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
int open_close_usb_device(uint8_t num, bool flag);

/*==================================================================================
* 函 数 名： open_close_led_device
* 参    数： num == led设备号;flag==true打开设备
* 功能描述:  打开关闭LED
* 返 回 值：
* 备    注： 创建成功返回0
* 作    者： lc
* 创建时间： 2021-05-25
==================================================================================*/
int open_close_led_device(uint8_t num, bool flag);

/*==================================================================================
* 函 数 名： get_hub_perdevice_status
* 参    数： 
* 功能描述:  获取当前HUB外设开关状态
* 返 回 值：
* 备    注： 个状态返回值
* 作    者： lc
* 创建时间： 2023-05-08
-----------------------------------------------------------------------------------
HUB1|HUB2|HUB3|HUB4|HUB5|HUB6|HUB7|HUB8|LED1|LED2|LED3|LED4|DOOR1|DOOR2|DOOR3|DOOR4|   
-----------------------------------------------------------------------------------
    |    |    |    |    |    |    |    |    |    |    |    |     |     |     |     |  
-----------------------------------------------------------------------------------
==================================================================================*/
int get_hub_perdevice_status(void);

/*==================================================================================
* 函 数 名： get_door_perdevice_status
* 参    数： 
* 功能描述:  获取当前门外设开关状态
* 返 回 值：
* 备    注： 个状态返回值
* 作    者： lc
* 创建时间： 2023-05-08
-----------------------------------------------------------------------------------
DOOR0|DOOR1|DOOR2|DOOR3|DOOR4|DOOR5|DOOR6|DOOR7|  
-----------------------------------------------------------------------------------
     |     |     |     |     |     |     |     |   
-----------------------------------------------------------------------------------
==================================================================================*/
int get_door_perdevice_status(void);

/*==================================================================================
* 函 数 名： get_lock_perdevice_status
* 参    数： 
* 功能描述:  获取门跟锁的状态
* 返 回 值： 0代表门打开
* 备    注： 个状态返回值
* 作    者： lc
* 创建时间： 2023-05-08
4.3.5:RFID 信号/门状态/锁舌状态在正常控制时的三者关系
对应关系
RFID 信号（门侦信号） 锁舌状态（锁侦信号） 门状态
有 有 关好
无 有 未关好
有 无 未关好
无 无 未关
==================================================================================*/
int get_lock_perdevice_status(void);

/*==================================================================================
* 函 数 名： get_all_perdevice_status
* 参    数： 
* 功能描述:  获取所有外设的设备状态
* 返 回 值：
* 备    注： 个状态返回值
* 作    者： lc
* 创建时间： 2023-05-08
-----------------------------------------------------------------------------------*/
struct devStatusRes get_all_perdevice_status(void);
