
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>

/*==================================================================================
* 函 数 名： app_wrplate_create_thread
* 参    数： Non
* 功能描述:  创建多线程任务
* 返 回 值：
* 备    注： 
* 作    者： lc
* 创建时间： 2021/5/6
==================================================================================*/
void app_bufei_create_thread(void);

/*==================================================================================
* 函 数 名： get_weigh_uuid_from_gd32
* 参    数： Non
* 功能描述:  从gd32获取重量跟用户卡信息
* 返 回 值：
* 备    注： 
* 作    者： lc
* 创建时间： 2021/4/16
==================================================================================*/
char* get_weigh_uuid_from_gd32(void);